"""
   🌺🌸🏵️🏵️🌻🌻🌸🌺🌺🌸🏵️🏵️🌻🌻🌸🌺
  
         created by Bhoopesh Maurya
         
         
   🌺🌸🏵️🏵️🌻🌻🌸🌺🌺🌸🏵️🏵️🌻🌻🌸🌺
   """

a = """
      🌸🌸
     🌸  🌸
     🌸🌸🌸
     🌸  🌸
     🌸  🌸
 """
b = """
    🌷🌷🌷
    🌷   🌷
    🌷🌷🌷
    🌷   🌷
    🌷🌷🌷
 """
c = """
    🌺🌺🌺
    🌺
    🌺
    🌺
    🌺🌺🌺
"""
d = """
    🏵🏵🏵
    🏵   🏵
    🏵   🏵
    🏵   🏵
    🏵🏵🏵
"""
e = """
    🌻🌻🌻
    🌻
    🌻🌻🌻
    🌻
    🌻🌻🌻
"""
f = """
    💠💠💠
    💠
    💠💠💠
    💠
    💠

"""
g = """
    🌼🌼🌼🌼
    🌼
    🌼  🌼🌼
    🌼    🌼   
    🌼🌼🌼🌼
"""
h = """
    🌹    🌹
    🌹    🌹
    🌹🌹🌹🌹
    🌹    🌹
    🌹    🌹
"""
I = """
     🌺🌺🌺
       🌺
       🌺
       🌺
     🌺🌺🌺
"""
j = """
     🌸🌸🌸
       🌸
       🌸
       🌸
    🌸🌸
"""
k = """
    🏵  🏵
    🏵 🏵
    🏵🏵
    🏵 🏵
    🏵  🏵

"""
l = """
    🌹
    🌹
    🌹
    🌹
    🌹🌹🌹
"""
M = """
    🌻     🌻
    🌻🌻  🌻🌻
    🌻 🌻🌻 🌻
    🌻      🌻
    🌻      🌻
"""
n = """
    🌷🌷   🌷
    🌷 🌷  🌷
    🌷  🌷 🌷
    🌷   🌷🌷  
    🌷     🌷   

"""
o = """
      🌸🌸🌸    
     🌸    🌸
    🌸      🌸
     🌸    🌸
      🌸🌸🌸

"""
p = """
     🏵🏵🏵🏵
     🏵    🏵
     🏵🏵🏵🏵
     🏵
     🏵
"""
q = """
      🌹🌹🌹
     🌹    🌹
     🌹    🌹
     🌹    🌹
      🌹🌹🌹 🌹          
"""
r = """
     💠💠💠
     💠   💠
     💠💠💠
     💠 💠
     💠   💠
"""
s = """
     🏵🏵🏵🏵
     🏵
     🏵🏵🏵🏵
           🏵   
     🏵🏵🏵🏵  
"""
t = """
     🌺🌺🌺🌺
        🌺
        🌺
        🌺
        🌺
"""
u = """
    🏵    🏵
    🏵    🏵
    🏵    🏵
    🏵    🏵
    🏵🏵🏵🏵
"""
v = """
    🏵   🏵
    🏵   🏵
    🏵   🏵
    🏵   🏵
     🏵🏵
"""
w = """
     ♡  ♡  ♡
     ♡  ♡  ♡
     ♡  ♡  ♡
     ♡  ♡  ♡
      ♡♡♡♡
"""
x = """
     🌼   🌼
      🌼 🌼
       🌼
      🌼 🌼
     🌼   🌼
"""
y = """
     💠  💠
      💠💠
       💠
       💠
       💠
"""
z = """
    🌹🌹🌹🌹
        🌹
       🌹
      🌹
     🌹🌹🌹🌹
"""
name = input().lower()
for i in name:
 if  i == "a":
  print(a)
 if i == "b":
  print(b)
 if i == "c":
  print(c)
 if i == "d":
  print(d)
 if i == "e":
  print(e)
 if i == "f":
  print(f)
 if i == "g":
  print(g)
 if i == "h":
  print(h)
 if i == "i":
  print(I)
 if i == "j":
  print(j)
 if i == "k":
  print(k)
 if i == "l":
  print(l)
 if i == "m":
  print(M)
 if i == "n":
  print(n)
 if i == "o":
  print(o)
 if i == "p":
  print(p)
 if i == "q":
  print(q)
 if i == "r":
  print(r)
 if i == "s":
  print(s)
 if i == "t":
  print(t)
 if i == "u":
  print(u)
 if i == "v":
  print(v)
 if i == "w":
  print(w)
 if i == "x":
  print(x)
 if i == "y":
  print(y)
 if i == "z":
  print(z)

print(__doc__)
